app/views/chatrooms/show.html.erb

      <ul>
        <% @registration.errors.full_message.each do |message| %>
---
SELECT "messages".* FROM "messages" WHERE "messages"."chatroom_id" = ?  [["chatroom_id", 1]]

<div class="panel panel-default">
  <% if @chatroom.messages.any? %>
---
SELECT  1 AS one FROM "messages" WHERE "messages"."chatroom_id" = ? LIMIT ?  [["chatroom_id", 1], ["LIMIT", 1]]