app/controllers/chatrooms_controller.rb

  def show
    @chatroom = Chatroom.find_by(id: params[:slug])
---
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]