app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("name", "provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "FutureStar"], ["provider", "twitter"], ["uid", "818618714429923328"], ["created_at", 2017-01-10 13:31:32 UTC], ["updated_at", 2017-01-10 13:31:32 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "twitter"], ["uid", "818618714429923328"], ["LIMIT", 1]]